src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <basedOn>Document.ОпросКлиента</basedOn>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>ОпросКлиента</name>
    <type>
      <types>DocumentRef.ОпросКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>EnumRef.СтатусЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЭтапов</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаУслуги</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУслуги</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыполняетСубподрядчик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьЭтапа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЭтапа</name>
      <type>
        <types>EnumRef.СтатусЭтапа</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокМатериалов</name>
    <attributes>
      <name>НомерЭтапа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикОплат</name>
    <attributes>
      <name>ДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ВидКонтактнойИнформации/ВидКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>НомерТелефона</name>
  </enumValues>
  <enumValues>
    <name>СсылкаВСоцсети</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>EnumRef.ВидКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/ЗаказКлиента/ManagerModule.bsl
Процедура ПечатьКоммерческогоПредложения(ТабДок, Ссылка) Экспорт
	Макет = Документы.ЗаказКлиента.ПолучитьМакет("ПечатьКоммерческогоПредложения");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СотрудникиКонтактнаяИнформация.Представление КАК Представление,
	|	СотрудникиКонтактнаяИнформация.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ТелефонОтветственный
	|ИЗ
	|	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
	|ГДЕ
	|	СотрудникиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Перечисление.ВидКонтактнойИнформации.НомерТелефона)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиКонтактнаяИнформация.Представление КАК Представление,
	|	СотрудникиКонтактнаяИнформация.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ПочтаОтветственный
	|ИЗ
	|	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
	|ГДЕ
	|	СотрудникиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Перечисление.ВидКонтактнойИнформации.АдресЭлектроннойПочты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Дата КАК Дата,
	|	ЗаказКлиента.Номер КАК Номер,
	|	ЗаказКлиента.Ответственный КАК Ответственный,
	|	ЗаказКлиента.СуммаЗаказа КАК СуммаЗаказа,
	|	ЗаказКлиента.СписокЭтапов.(
	|		НомерСтроки КАК НомерСтроки,
	|		Услуга КАК Услуга,
	|		ЦенаУслуги КАК ЦенаУслуги,
	|		Количество КАК Количество,
	|		СуммаУслуги КАК СуммаУслуги,
	|		ДатаНачала КАК ДатаНачала,
	|		ДатаОкончания КАК ДатаОкончания,
	|		СтоимостьЭтапа КАК СтоимостьЭтапа
	|	) КАК СписокЭтапов,
	|	ЗаказКлиента.СписокМатериалов.(
	|		НомерСтроки КАК НомерСтроки,
	|		Материал КАК Материал,
	|		Цена КАК Цена,
	|		Количество КАК Количество,
	|		Сумма КАК Сумма
	|	) КАК СписокМатериалов,
	|	ЗаказКлиента.ГрафикОплат.(
	|		НомерСтроки КАК НомерСтроки,
	|		ДатаПлатежа КАК ДатаПлатежа,
	|		СуммаПлатежа КАК СуммаПлатежа
	|	) КАК ГрафикОплат,
	|	ВТ_ТелефонОтветственный.Представление КАК ТелефонОтветственный,
	|	ВТ_ПочтаОтветственный.Представление КАК ПочтаОтветственный
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТелефонОтветственный КАК ВТ_ТелефонОтветственный
	|		ПО ЗаказКлиента.Ответственный = ВТ_ТелефонОтветственный.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПочтаОтветственный КАК ВТ_ПочтаОтветственный
	|		ПО ЗаказКлиента.Ответственный = ВТ_ПочтаОтветственный.Ссылка
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");

	ОбластьСписокУслугШапка = Макет.ПолучитьОбласть("СписокУслугШапка");
	ОбластьСписокУслуг = Макет.ПолучитьОбласть("СписокУслуг");

	ОбластьСписокМатериаловШапка = Макет.ПолучитьОбласть("СписокМатериаловШапка");
	ОбластьСписокМатериалов = Макет.ПолучитьОбласть("СписокМатериалов");

	ОбластьСписокЭтаповШапка = Макет.ПолучитьОбласть("СписокЭтаповШапка");
	ОбластьСписокЭтапов = Макет.ПолучитьОбласть("СписокЭтапов");

	ОбластьГрафикОплатШапка = Макет.ПолучитьОбласть("ГрафикОплатШапка");
	ОбластьГрафикОплат = Макет.ПолучитьОбласть("ГрафикОплат");

	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбластьЗаголовок.Параметры.Номер = Число(Выборка.Номер);
		ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=DD");
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокУслугШапка);
		ВыборкаСписокУслуг = Выборка.СписокЭтапов.Выбрать();
		Пока ВыборкаСписокУслуг.Следующий() Цикл
			ОбластьСписокУслуг.Параметры.Заполнить(ВыборкаСписокУслуг);
			ТабДок.Вывести(ОбластьСписокУслуг, ВыборкаСписокУслуг.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьСписокМатериаловШапка);
		ВыборкаСписокМатериалов = Выборка.СписокМатериалов.Выбрать();
		Пока ВыборкаСписокМатериалов.Следующий() Цикл
			ОбластьСписокМатериалов.Параметры.Заполнить(ВыборкаСписокМатериалов);
			ТабДок.Вывести(ОбластьСписокМатериалов, ВыборкаСписокМатериалов.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьСписокЭтаповШапка);
		ВыборкаСписокЭтапов = Выборка.СписокЭтапов.Выбрать();
		Пока ВыборкаСписокЭтапов.Следующий() Цикл
			ОбластьСписокЭтапов.Параметры.Заполнить(ВыборкаСписокЭтапов);
			ТабДок.Вывести(ОбластьСписокЭтапов, ВыборкаСписокЭтапов.Уровень());
		КонецЦикла;
		ТабДок.Вывести(ОбластьГрафикОплатШапка);
		ВыборкаГрафикОплат = Выборка.ГрафикОплат.Выбрать();
		Пока ВыборкаГрафикОплат.Следующий() Цикл
			ОбластьГрафикОплат.Параметры.Заполнить(ВыборкаГрафикОплат);
			ТабДок.Вывести(ОбластьГрафикОплат, ВыборкаГрафикОплат.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
КонецПроцедуры

Процедура ПечатьДоговора(ТабДок, Ссылка) Экспорт
	Макет = Документы.ЗаказКлиента.ПолучитьМакет("ПечатьДоговора");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказКлиента.Дата КАК Дата,
	|	ЗаказКлиента.Номер КАК Номер,
	|	ЗаказКлиента.ОпросКлиента.Клиент КАК Клиент,
	|	ГенеральныйДиректорКомпании.Значение КАК Директор,
	|	ЗаказКлиента.ОпросКлиента.Клиент.Реквизиты КАК РеквизитыКлиент
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента,
	|	Константа.ГенеральныйДиректорКомпании КАК ГенеральныйДиректорКомпании
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОсновнаяЧасть = Макет.ПолучитьОбласть("ОсновнаяЧасть");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбластьЗаголовок.Параметры.Номер = Число(Выборка.Номер);
		ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=DD");
		ТабДок.Вывести(ОбластьЗаголовок);

		ОсновнаяЧасть.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОсновнаяЧасть, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
КонецПроцедуры
